#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен ми використовуємо.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
    float i, j, a, b, s, n, m; // Задаємо фундаментальні типи даних, вбудованих у компілятор, який використовується для визначення числових значень.
    long double res_m=1, res_n=1, res_b=1; // Задаємо дійсні числа подвійної точності з плаваючою точкою не менше 8 байт (64 біт).
    cout << "\n\n\t\t\t\t\t\t      (m!+n!)\n\t\t\t\tЦя програма обчислює  -------  для натуральних чисел.\n\t\t\t\t\t\t       (m+n)!\n\n\t\t\t\tДля цього введіть натуральні значення n та m.\n\n\t\t\t\tn = "; // Нові строки, горизонтальна табуляція, виводимо на консоль символи.
    cin >> n; // Користувач вводить число.
    for (;;) // Безкінечний цикл.
    {   
        if (!cin) // Якщо не число.
        {   
            cout << "\t\t\t\tЦе взагалі число?"; // Горизонтальна табуляція, виводимо на консоль символи.
            return 0; // Без повторень.
        }
        if (n<=0) // Якщо число не додатне.
        {
        while (n<=0) // Поки число не додатне.
            {
                cout << "\t\t\t\tЧисло має бути додатнім.\n\t\t\t\tn = "; // Горизонтальна табуляція, виводимо на консоль символи.
                cin >> n; // Користувач вводить число.
            }
        }
        if (int(n)!=n) // Якщо n не ціле.
        {
        while (int(n)!=n) // Поки n не ціле.
        {
            cout << "\t\t\t\tЧисло має бути цілим.\n\t\t\t\tn = "; // Горизонтальна табуляція, виводимо на консоль символи, горизонтальна табуляція.
            cin >> n; // Користувач вводить число.
        }
        }
        if (n>0 && int(n)==n) // Якщо n додатне і ціле.
        {   
            cout << "\t\t\t\tm = "; // Горизонтальна табуляція, виводимо на консоль символи.
            cin >> m; // Користувач вводить число.
            for (;;) // Безкінечний цикл.
            {
                if (!cin) // Якщо не число.
                {   
                    cout << "\t\t\t\tЦе взагалі число?"; // Горизонтальна табуляція, виводимо на консоль символи.
                    return 0; // Без повторень.
                }
                if (m<=0) // Якщо число не додатне.
                {
                    while (m<=0) // Поки число не додатне.
                    {
                        cout << "\t\t\t\tЧисло має бути додатнім.\n\t\t\t\tm = "; // Горизонтальна табуляція, виводимо на консоль символи, горизонтальна табуляція.
                        cin >> m; // Користувач вводить число.
                    }
                }
                if (int(m)!=m) // Якщо m не ціле.
                {
                    while (int(m)!=m) // Поки число не ціле.
                    {
                        cout << "\t\t\t\tЧисло має бути цілим.\n\t\t\t\tm = "; // Горизонтальна табуляція, виводимо на консоль символи, горизонтальна табуляція.
                        cin >> m; // Користувач вводить число.
                    }
                }
                if (m>0 && int(m)==m) // Якщо m додатне і ціле.
                {
                    i=n; // i приймає значення n.
                    j=m; // j приймає значення m.
                    for (i=1; i<=n; i++) // У той момент коли i дорівнює одиниці, i менше або дорівнює n, до і додається одиниця.
                    {
                        res_n=res_n*i;  // Обчислюємо факторіал, множемо число, яке ввів користуач на число, яке на одиницю менше.
                    }
                    for (j=1; j<=m; j++) // У той момент коли j дорівнює одиниці, j менше або дорівнює m, до j додається одиниця.
                    {
                        res_m=res_m*j;  // Обчислюємо факторіал, множемо число, яке ввів користуач на число, яке на одиницю менше.
                    }
                    a=res_n+res_m; // a приймає значення суми res_n і res_m.
                    b=n+m; // b приймає значення суми n і m.
                    for (s=1; s<=b; s++) // У той момент коли s дорівнює одиниці, s менше або дорівнює b, до s додається одиниця.
                    {
                        res_b=res_b*s; // обчислюємо факторіал значення b.
                    }
                    long double f=a/res_b;  // Задаємо дійсне число подвійної точності з плаваючою точкою не менше 8 байт (64 біт).
                    cout << "\n\n\t\t\t\t\t\t("<< m << "!+" << n << "!)\n\t\t\t\t\t\t------- = " << f << "\n\t\t\t\t\t\t (" << m << "+" << n << ")!\n\n";
                    return 0; // Без повторень.
                }
            }
        }
    }
}