#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
    char ursname[31], name[31], patronymic[31], genus[21], date_of_birth[21], adress[101], phone_number[21], place_of_study[41], group[11], hobby[101]; // Вказуємо масиви символів.
    cout<<"       Прізвище?=" << " : "; // Виводимо на консоль символи.
    cin.getline(ursname, 31); // Користувач вводить у cin символи із 30 елементів при виводі.
    cout<<"           Імʼя?=" << " : "; // Виводимо на консоль символи.
    cin.getline(name, 31); // Користувач вводить у cin символи із 30 елементів при виводі.
    cout<<"    По батькові?=" << " : "; // Виводимо на консоль символи.
    cin.getline(patronymic, 31); // Користувач вводить у cin символи із 30 елементів при виводі.
    cout << "          Стать?=" << " : "; // Виводимо на консоль символи.
    cin.getline(genus, 21); // Користувач вводить у cin символи із 20 елементів при виводі.
    cout << "Дата народження?=" << " : "; // Виводимо на консоль символи.
    cin.getline(date_of_birth, 21); // Користувач вводить у cin символи із 20 елементів при виводі.
    cout<<"         Адреса?=" << " : "; // Виводимо на консоль символи.
    cin.getline(adress, 101); // Користувач вводить у cin символи із 100 елементів при виводі.
    cout<<" Номер телефону?=" << " : "; // Виводимо на консоль символи.
    cin.getline(phone_number, 21); // Користувач вводить у cin символи із 20 елементів при виводі.
    cout<<" Місце навчання?=" << " : "; // Виводимо на консоль символи.
    cin.getline(place_of_study, 41); // Користувач вводить у cin символи із 40 елементів при виводі.
    cout<<"          Група?=" << " : "; // Виводимо на консоль символи.
    cin.getline(group, 11); // Користувач вводить у cin символи із 10 елементів при виводі.
    cout<<"           Хобі?=" << " : "; // Виводимо на консоль символи.
    cin.getline(hobby, 101); // Користувач вводить у cin символи із 100 елементів при виводі.
    cout << "\n\t\t\t   АНКЕТА"<< endl; // Нова строка, горизонтальна табуляція, виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\nПрізвище : " << ursname << "\t"; // Нова строка, виводимо на консоль символи, і те, що прописав користувач, а також робимо горизонтальну табуляцію.
    cout << "Імʼя : " << name << "\t"; // Виводимо на консоль символи, і те, що прописав користувач, а також робимо горизонтальну табуляцію.
    cout << "По батькові : " << patronymic << endl; // Виводимо на консоль символи, те, що прописав користувач, і переходимо на наступний рядок.
    cout << "Номер телефону : " << phone_number << "\t"; // Виводимо на консоль символи, те, що прописав користувач, і робимо горизонтальну табуляцію.
    cout << "Хобі : " << hobby << endl; // Виводимо на консоль символи, те, що прописав користувач, і переходимо на наступний рядок.
    cout << "Місце навчання : " << place_of_study << "\t\t\t"; // Виводимо на консоль символи, те, що прописав користувач, і робимо горизонтальну табуляцію.
    cout << "Група : " << group << endl; // Виводимо на консоль символи, те, що прописав користувач, і переходимо на наступний рядок.
    cout << "Дата народження : " << date_of_birth << "\t\t"; // Виводимо на консоль символи, те, що прописав користувач, і робимо горизонтальну табуляцію.
    cout << "Стать : " << genus << endl; // Виводимо на консоль символи, те, що прописав користувач, і переходимо на наступний рядок.
    cout << "Адреса : " << adress; // Виводимо на консоль символи, і те, що прописав користувач.
    return 0; // Робимо так, щоб програма працювала без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).