#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
    int a; // Задаємо змінну.
    cout << "\n\n\n\n\n"; // Нові строки.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "******************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "Привіт, друже. Давай зіграємо?" << endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "******************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\n\n\n\n\n\t\t\t\t\t\t\t\tНатисни Enter, щоб продовжити."; // Робимо нові строки, горизонтальну табуляцію, і виводимо на консоль символи.

    fgetc(stdin);// Зупинка програми.
    system ("clear"); // Очистка екрану. 
    cout << "\033[2J\033[H"; // Зупинка програми.

    cout << "\n\n\n\n\n"; // Нові строки.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "******************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "        Задумай число." << endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "******************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\n\n\n\n\n\t\t\t\t\t\t\t\tНатисни Enter, щоб продовжити."; // Робимо нові строки, горизонтальну табуляцію, і виводимо на консоль символи.
    fgetc(stdin);// Зупинка програми.
    system ("clear"); // Очистка екрану. 
    cout << "\n\n\n\n\n"; // Нові строки.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "******************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "      Помнож його на 10." << endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "******************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\n\n\n\n\n\t\t\t\t\t\t\t\tНатисни Enter, щоб продовжити."; // Робимо нові строки, горизонтальну табуляцію, і виводимо на консоль символи.
   fgetc(stdin);// Зупинка програми.
    system ("clear"); // Очистка екрану. 
    cout << "\n\n\n\n\n"; // Нові строки.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "***************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "Поділи отримане число на 2." << endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "***************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\n\n\n\n\n\t\t\t\t\t\t\t\tНатисни Enter, щоб продовжити."; // Робимо нові строки, горизонтальну табуляцію, і виводимо на консоль символи.
    fgetc(stdin);// Зупинка програми.
    system ("clear"); // Очистка екрану. 
    cout << "\n\n\n\n\n"; // Нові строки.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "*****************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "      Помнож його на 3." << endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "*****************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\n\n\n\n\n\t\t\t\t\t\t\t\tНатисни Enter, щоб продовжити."; // Робимо нові строки, горизонтальну табуляцію, і виводимо на консоль символи.
    fgetc(stdin);// Зупинка програми.
    system ("clear"); // Очистка екрану. 
    cout << "\n\n\n\n\n"; // Нові строки.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "*****************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << " Поділи отримане число на 5." << endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "*****************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\n\n\n\n\n\t\t\t\t\t\t\t\tНатисни Enter, щоб продовжити."; // Робимо нові строки, горизонтальну табуляцію, і виводимо на консоль символи.
    fgetc(stdin);// Зупинка програми.
    system ("clear"); // Очистка екрану. 
    cout << "\n\n\n\n\n"; // Нові строки.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "*****************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "      Помнож його на 2." << endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "*****************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\n\n\n\n\n\t\t\t\t\t\t\t\tНатисни Enter, щоб продовжити."; // Робимо нові строки, горизонтальну табуляцію, і виводимо на консоль символи.
    fgetc(stdin);// Зупинка програми.
    system ("clear"); // Очистка екрану. 
    cout << "\n\n\n\n\n"; // Нові строки.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "Введи відповідь: "; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cin >> a; // Користувач вводить число.
    system ("clear"); // Очистка екрану. 
    fgetc(stdin);// Зупинка програми.
    cout << "\n\n\n\n\n"; // Нові строки.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "******************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "      Ти загадав число " << a/6 << "." << endl; // Виводимо на консоль символи, ділимо на 6 число, яке прописав користувач, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "******************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\n\n\n\n\n\t\t\t\t\t\t\t\tНатисни Enter, щоб продовжити."; // Робимо нові строки, горизонтальну табуляцію, і виводимо на консоль символи.
    fgetc(stdin);// Зупинка програми.
    system ("clear"); // Очистка екрану. 
    cout << "\n\n\n\n\n"; // Нові строки.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "*****************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "       Дякую за гру!!!" << endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    cout << "\t\t\t\t\t"; // Горизонтальна табуляція.
    cout << "*****************************"<<endl; // Виводимо на консоль символи, і переходимо на наступний рядок.
    return 0; // Робимо так, щоб програма працювала без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).