#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
    char name[61]; // Вказуємо масив символів на 61 елементів.
    cout << "Як вас звуть?="; // Виводимо на консоль символи.
    cin.getline(name,61); // Користувач вводить у cin символи із 60 елементів при виводі.
    cout << "Доброго дня, " << name << "!"; // Виводимо на консоль символи, і те, що прописав користувач.
    return 0; // Робимо так, щоб програма працювала без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).



