#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
    char name[41], old[4], place_of_study[51]; // Вказуємо масив символів на 41 елементів для name, 4 для old, 51 для place_of_study.
    cout << "Як вас звуть? ="; // Виводимо на консоль символи.
    cin.getline(name, 41); // Користувач вводить у cin символи із 40 елементів при виводі.
    cout << "Доброго дня, " << name << "!" << endl; // Виводимо на консоль символи, те, що прописав користувач, і переходимо на наступний рядок.
    cout << "Cкільки Вам років? ="; // Виводимо на консоль символи.
    cin.getline(old, 4); // Користувач вводить у cin символи із 3 елементів при виводі.
    cout << "Вітаємо Вас, Вам усього " << old << ", а Ви вже ведете діалог з комп’ютером!" << endl; // Виводимо на консоль символи, те, що прописав користувач, і переходимо на наступний рядок.
    cout << "Де Ви навчаєтеся? ="; // Виводить на консоль текст.
    cin.getline(place_of_study, 51); // Користувач вводить у cin символи із 50 елементів при виводі.
    cout << place_of_study << " буде пишатися Вами!"; // Виводимо на консоль символи, і те, що прописав користувач.
    return 0; // Робимо так, щоб програма працювала без повторень.
} /// Фігурні дужки в яких пишется основний код програми (кінець).

