#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
    char sentence[101]; // Вказуємо масив символів на 101 елементів.
    cout << "Що скаже папуга?=";  // Виводимо на консоль символи.
    cin.getline(sentence, 101); // Користувач вводить у cin символи із 100 елементів при виводі.
    cout << sentence;  // Виводимо на консоль символи, і те, що прописав користувач.
    return 0; // Робимо так, щоб програма працювала без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).




