#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ /// Фігурні дужки в яких пишется основний код програми (початок).
    int A, B, C, D, temp; // Задаємо змінні.
    cout << "Задайте числа для А, В, С, D."<< endl;  // Виводимо на консоль символи, переходимо на наступний рядок.
    cout << "A="; // Виводимо на консоль символи.
    cin >> A; // Користувач вводить число.
    cout << "B="; // Виводимо на консоль символи.
    cin >> B; // Користувач вводить число.
    cout << "C="; // Виводимо на консоль символи.
    cin >> C; // Користувач вводить число.
    cout << "D="; // Виводимо на консоль символи.
    cin >> D; // Користувач вводить число.
    cout << "Дані значення: А=" << A << ", В=" << B << ", С=" << C << ", D=" << D << "." << endl; // Виводимо на консоль символи, і значення, які користувач прописував раніше, переходимо на наступний рядок.
    temp=D; // temp приймає значення D.
    D=A; // D приймає значення A.
    A=temp; // A приймає значення temp.
    temp=D; // temp приймає значення D.
    D=B; // D приймає значення B.
    B=temp; // B приймає значення temp.
    temp=D; // temp приймає значення D.
    D=C; // D приймає значення C.
    C=temp; // C приймає значення temp.
    cout << "Значення після обміну: А=" << A << ", В=" << B << ", С=" << C << ", D=" << D << "."; // Виводимо на консоль символи, і значення, які користувач прописував раніше, але змінені програмою.
    return 0; // Робимо так, щоб програма працювала без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).

