#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
  int  n, c=0; // Задаємо змінну та сталу.
  cout << "Ця програма знаходить скільки серед чисел непарних.\nВведіть послідовність цілих чисел. Нуль – ознака кінця.\n"; // Виводимо на консоль символи, нова строка.
  while ( cout << "Введіть число = ",cin >> n, n!=0) // Поки виводиться "Введіть число = ", та вводяться числа, програма чекає вводу 0, щоб виконати наступні дії.
  {
    if(n%2) // Якщо непарні члени послідовноcnі.
    {
      c++; // Знаходить кількість непарних чисел.
    }
  }
  cout << "Зустрілося " << c << " непарних числ."; // Вивід символів на консоль та значення "c" після виконання дії "Знаходить кількість непарних чисел".
  return 0; // Робимо так, щоб програма працювала без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).
