#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
    int i, res=1; // Задаємо змінну та сталу.
    float n; // Задаємо змінную.
    cout << "\nДля обчислення N! введіть:\n"; // Виводимо на консоль символи, нова строка.
    cout << "N = "; // Виводимо на консоль символи.
    cin >> n; // Вводимо число.
    while (cin >> n) // Поки вводиться число.
    if (!cin) // Якщо введено не число.
    {
        cout << "N має бути записане у вигляді цифр.\n"; // Виводимо на консоль символи, нова строка.
    }
    else // Інакше.
    {
      while (true) // Поки істина.
      {   
        if (n<0) // якщо значення n менше нуля.
        {
            cout << "N має бути не невідємним.\n"; // Виводимо на консоль символи, нова строка.
            cout << "N = "; // Виводимо на консоль символи.
            cin >> n; // Вводимо число.
        }
        if (n>=0) // Якщо, значення n більше або дорівнює нулю.
        {           

            if (int(n)==n) // Якщо число ціле.
            {
                i=n; // присвоюємо значенню i значення n.
                for (i=1; i<=n; i++) // Доки i дорівнює одиниці, і менш або дорівнює n, до і додається одиниця.
                {
                    res=res*i; // Обчислюємо факторіал, множемо число, яке ввів користуач на число, яке на одиницю менше.
                }
                cout << n << "! = " <<res;
                return 0; // Робимо так, щоб програма працювала без повторень.
            }
            else // Інакше.
            {
                cout << "N має бути натуральним.\n"; // Виводимо на консоль символи, нова строка.
                cout << "N = "; // Виводимо на консоль символи.
                cin >> n; // Вводимо число.
            }
        }
      }    
    }
    return 0; // Робимо так, щоб програма працювала без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).
