#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
    int n; // Задаємо змінну.
    cout << "Ця програма обчислює число Фібоначчі з номером N (тобто f[N])та виводить його на екран.\nN="; // Виводимо на консоль символи, нова строка.
    cin >> n; // Вводимо число.
    long arr[n+1]; // Задаємо великий вміст числа arr, яке дорівнює n+1.
    arr[0]=0; // Значення arr дорівнює 0, то саме значення 0.
    arr[1]=1; // Значення arr дорівнює 1, то саме значення 1.
    for(int i=2; i<=n; i++) // Якщо i=2, i менше або дорівнює n, до і додається одиниця.
    {
        arr[i]=arr[i-1]+arr[i-2]; // Обчислення числа Фібоначчі.
    }
    cout << "F(" << n << ")=" << arr[n]; // вивід на консоль символів та значень.
    return 0; // Робимо так, щоб програма працювала без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).