#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
#include <ctime> // Підключаємо бібліотека для задання рандомного числа.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
  int X2, Y2, X0, Y0, R, X1, Y1, a, b, c, d, X3, Y3; // Задаємо змінні.
  srand(time(NULL)); // Водимо систему, щоб число було рандомне.
  X0=rand()%30; // Присвоюємо X0 ціле значення, від 0 до 30;
  Y0=rand()%30; // Присвоюємо Y0 ціле значення, від 0 до 30;
  R=rand()%10+1; // Присвоюємо R ціле значення, від 1 до 10;
  cout << "Програма перевіряє, чи потрапляє точка A всередину (або на кордон) кола O.\n"; // Виводимо на консоль символи, нова строка.
  while (cout << "Введи кординати точки А ( x, y )\n\n", cout << "X = ", cin >> X1, cout << endl, cout << "Y = ", cin >> Y1, cout << endl) // Виводимо на консоль символи, нові строки, вводимо числа.
  {
    if ((X1-X0)*(X1-X0)+(Y1-Y0)*(Y1-Y0)<=R*R) // Якщо точка потрапляє в коло, або на його межі.
    {
      cout << "Точка А ( " << X1 << ", " << Y1 << " ) знаходиться в коло з центром в точці (" << X0 << ", " << Y0 << ") і радіусом " << R << ".";
      return 0; // Робимо так, щоб програма працювала без повторень.
    }
    while ((X1-X0)*(X1-X0)+(Y1-Y0)*(Y1-Y0)>R*R) // Якщо точка не потрапляє в коло, або на його межі.
    {   
      X2=X1; // Значенню Х2 надаємо значення Х1.
      Y2=Y1; // Значенню У2 надаємо значення У1.
      cout << "\nCпробуй ще раз.\n\n"; // Виводимо на консоль символи, нові строки.
      cout << "X = "; // Виводимо на консоль символи.
      cin >> X1; // Вводимо число.
      cout << endl; // Нова строка.
      cout << "Y = "; // Виводимо на консоль символи.
      cin >> Y1; // Вводимо число.
      if ((X1-X0)*(X1-X0)+(Y1-Y0)*(Y1-Y0)<=R*R) // Якщо точка потрапляє в коло, або на його межі.
      {
        cout << "\nТочка А ( " << X1 << ", " << Y1 << " ) знаходиться в коло з центром в точці (" << X0 << ", " << Y0 << ") і радіусом " << R << ".";
        return 0; // Робимо так, щоб програма працювала без повторень.
      }
      X3=X1; // Значенню Х3 надаємо значення Х1.
      Y3=Y1; // Значенню У3 надаємо значення Х1.
      if ((X1-X0)*(X1-X0)+(Y1-Y0)*(Y1-Y0)>R*R) // Якщо точка не потрапляє в коло, або на його межі.
      {
        a=X0-X2; // Значенню a надаємо значення різниці Х0 та Х2.
        if(a<0) // Якщо а менше 0.
        {
          a=-a; // Модуль значення а.
        }
        b=X0-X3; // Значенню b надаємо значення різниці Х0 та Х3.
        if(b<0) // Якщо b менше 0.
        {
          b=-b; // Модуль значення b
        }
        c=Y0-Y2; // Значенню c надаємо значення різниці Y0 та Y2.
        if(c<0) // Якщо c менше 0.
        {
          c=-c; // Модуль значення c.
        }
        d=Y0-Y3;  // Значенню a надаємо значення різниці Y0 та Y3.
        if(d<0) // Якщо d менше 0.
        {
          d=-d; // Модуль значення d.
        }
        if (a<b) // Якщо a менше b.
        {
          cout << "\nХолодніше по осі Х\n"; // Нові строки, виводимо символи.
        }
        if (a>b) // Якщо a більше b.
        {
          cout << "\nТепліше по осі Х\n"; // Нові строки, виводимо символи.
        }
        if (c<d) // Якщо c менше d.
        {
          cout << "\nХолодніше по осі Y\n"; // Нові строки, виводимо символи.
        }
        if (c>d)  // Якщо с більше d.
        {
          cout << "\nТепліше по осі Y\n"; // Нові строки, виводимо символи.
        }
        if (X1==X0) // Якщо Х1 дорівнює Х0.
        {
          cout << "\n X Знайдено.\n"; // Нові строки, виводимо символи.
        }
        if (Y1==Y0) // Якщо Y1 дорівнює Y0.
        {
          cout << "\n Y Знайдено.\n"; // Нові строки, виводимо символи.
        }
      }
    }
  }
} // Фігурні дужки в яких пишется основний код програми (кінець).
   