#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
#include <limits> // Підключаємо бібліотека для введення ліміту.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
  int  n, i=1, max=numeric_limits<int>::lowest(); // Задаємо сталі, змінні.
  cout << "Ця програма знаходить найбільший із усіх членів послідовності.\nВведіть послідовність цілих чисел. Нуль – ознака кінця.\n"; // Виводимо на консоль символи, нові строки.
  while (cout << "a[" << i++ << "] = ",cin >> n, n!=0)  // Поки виводиться а[1], a[2],...,a[n], та вводяться числа, програма чекає вводу 0, щоб виконати наступні дії.
  {
   if (n>max) // Якщо n більше max;
   {  
      max = n; // max приймає значення n.
   }
  }
  cout << "MAX = " << max; // Виводимо на консоль символи, та значення max.
    return 0; // Робимо так, щоб програма працювала без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).