#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
   int num; // Задаємо змінну.
   cout << "Працює інформаційна система ФПМ:\n1. Новини дня\n2. Анекдот тижня\n3. Автора!\n0. Вихід\nВведіть відповідний номер та натисніть  ENTER.\n"; // Виводимо на консоль символи, нові строки.
   while (cin >> num) // Поки вводиться число.
   {
    switch(num) // Якщо вираження дорівнює.
    {
     case 0: // Значенню 0.
      return 0; // Робимо так, щоб програма працювала без повторень.
     case 1: // Значенню 1.
        printf("\033c "); // Очистка екрану. 
        cout << "\n\n\n\n\t\t\t\t\t\tНовини дня\n\nСьогодні четверта лабораторна робота з програмування. Усі до неї підготувалися, тому отримали 5, але з малою різницею у відсотках.\n\nНатисни 4 і ENTER, щоб повернутись в головне меню, або 0 і ENTER, щоб вийти."; // Нові строки, горизонтальна табуляція, виводимо на консоль символи.
        break; // Зупиняє роботу case 1.
     case 2: // Значенню 2.
        printf("\033c "); // Очистка екрану. 
        cout << "\n\n\n\n\t\t\t\t\t\tАнекдот тижня\n\nГрають Каспаров із Крамником у шахи. У Каспарова позиція вже зовсім погана, але здаватися не хочеться. Ось він дивиться у віконце і бачить там якогось собачку.\n\nКаспаров:\n— Чуєш, Володю, чия це собачка бігає?\nКрамник:\n- Нічия.\nКаспаров:\n- Згоден.\n\nНатисни 4 і ENTER, щоб повернутись в головне меню, або 0 і ENTER, щоб вийти."; // Нові строки, горизонтальна табуляція, виводимо на консоль символи.
        break;  // Зупиняє роботу case 2. 
     case 3: // Значенню 3.
        printf("\033c "); // Очистка екрану. 
        cout << "\n\n\n\n\t\t\t\t\t\tАвтора !!!\n\nОвдієнко Андрій\n\nНатисни 4 і ENTER, щоб повернутись в головне меню, або 0 і ENTER, щоб вийти."; // Нові строки, горизонтальна табуляція, виводимо на консоль символи.
        break; // Зупиняє роботу case 3.
     case 4: // Значенню 4.
        printf("\033c ");  // Очистка екрану. 
        cout << "Працює інформаційна система ФПМ:\n1. Новини дня\n2. Анекдот тижня\n3. Автора!\n0. Вихід\nВведіть відповідний номер та натисніть  ENTER.\n"; // Виводимо на консоль символи, нові строки.
        break; // Зупиняє роботу case 4.
     default: // Якщо такого значення немає.
        printf("\033c "); // Очистка екрану. 
        cout << "Я казав вводити це число? Спрообуй ще раз.\nПрацює інформаційна система ФПМ:\n1. Новини дня\n2. Анекдот тижня\n3. Автора!\n0. Вихід\nВведіть відповідний номер та натисніть  ENTER.\n"; // Виводимо на консоль символи, нові строки.
     break; // Зупиняє роботу "default".
    }
   }
} // Фігурні дужки в яких пишется основний код програми (кінець).&& 