#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
    char sentence[101]; // Задаємо масив змінних.
    cout << "Програма виконує дії папуги - повторює за користувачем, до того часу, поки не буде введений порожній рядок (тобто не натисне просто ENTER).\n"; // Виводимо на консоль символи, нова строка.
    while (cout << "\nЩо скаже папуга?=", cin.getline(sentence, 100)) // Поки йде перхід на наступну строку, виводиться "Що скаже папуга?=", користувач заповнює масив із 100 символів.
    {
        cout << sentence;// Виводимо на консоль те, що прописав користувач.
        if (sentence[0] == 0) {break;} // Якщо введений порожній рядок - вихід із циклу "While".
    }   
    return 0; // Робимо так, щоб програма працювала без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).
