#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
  int  n, i=1, sum=0; // Задаємо змінну та сталі.
  cout << "Ця програма знаходить суму всіх членів послідовності.\nВведіть послідовність цілих чисел. Нуль – ознака кінця.\n"; // Виводимо на консоль символи, нова строка.
  while (cout << "a[" << i++ << "] = ",cin >> n, n!=0) // Поки виводиться а[1], a[2],...,a[n], та вводяться числа, програма чекає вводу 0, щоб виконати наступні дії.
  {
    sum+=n; // Знаходить суму всіх членів послідовності n, та присвоює це значення sum.
  }
  cout << "SUM = " << sum; // Виводимо на консоль символи, та значення sum.
    return 0; // Робимо так, щоб програма працювала без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).
