#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен ми використовуємо.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
cout<<"       Прізвище" << " : " << "Овдієнко\n"; // Виводимо на консоль символи, нова строка.
cout<<"           Імʼя" << " : " << "Андрій\n"; // Виводимо на консоль символи, нова строка.
cout<<"    По батькові" << " : " << "Володимирович\n"; // Виводимо на консоль символи, нова строка.
cout<<"          Стать" << " : " << "чоловіча\n"; // Виводимо на консоль символи, нова строка.
cout<<"Дата народження" << " : " << "17.05.2005\n"; // Виводимо на консоль символи, нова строка.
cout<<"         Адреса" << " : " << "вул. Високовольтна 32, кв. 45, Дніпро, Україна\n"; // Виводимо на консоль символи, нова строка.
cout<<" Номер телефону" << " : " << "+380-99-627-60-64\n"; // Виводимо на консоль символи, нова строка.
cout<<" Місце навчання" << " : " << "ФПМ, ДНУ ім. Олеся Гончара\n"; // Виводимо на консоль символи, нова строка.
cout<<"          Група" << " : " << "ПА-22-2\n"; // Виводимо на консоль символи, нова строка.
cout<<"           Хобі" << " : " << "Математика, програмування, шахи, тхеквондо\n"; // Виводимо на консоль символи, нова строка.
return 0; // Без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).