#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен ми використовуємо.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
cout<<"o o o o o o\n"; // Виводимо на консоль символи, нова строка.
cout<<"o         o\n"; // Виводимо на консоль символи, нова строка.
cout<<"o         o\n"; // Виводимо на консоль символи, нова строка.
cout<<"o         o\n"; // Виводимо на консоль символи, нова строка.
cout<<"o         o\n"; // Виводимо на консоль символи, нова строка.
cout<<"o o o o o o\n"; // Виводимо на консоль символи, нова строка.
return 0; // Без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).