#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен ми використовуємо.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
    int X; // Задаємо змінну.
    cout << "Введіть значення Х, та отримаєте його модуль.\n"; // Виводимо на консоль символи, нова строка.
    cout << "Х = "; // Виводимо на консоль символи.
    cin >> X; // Користувач вводить число.
    if (X<0) // Якщо значення Х менше від нуля.
    { // Фігурні дужки перед початком виконання даної умови "Якщо значення Х менше від нуля".
     cout << "|" << X << "| = " << -X; // Виводимо на консоль символи, і те, що прописав користувач.
    } // Фігурні дужки після кінця виконання даної умови "Якщо значення Х менше від нуля".
    else // Інакше.
    { // Фігурні дужки перед виконанням дій - інакше, якщо умова, яка задана раніше не виконується.
    cout << "|" << X << "| = " << X; // Виводимо на консоль символи, і те, що прописав користувач.
    } // Фігурні дужки після виконанням дій - інакше, якщо умова, яка задана раніше не виконується.
    return 0; // Без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).