#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен ми використовуємо.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
  int X, Y, X0, Y0, R; // Задаємо змінні.
  cout << "Задумайте окружність O з центром в точці (Х0, Х0) і радіусом R.\n"; // Виводимо на консоль символи, нова строка.
  cout << "X0 = "; // Виводимо на консоль символи.
  cin >> X0; // Користувач вводить число.
  cout << "Y0 = "; // Виводимо на консоль символи.
  cin >> Y0; // Користувач вводить число.
  cout << "R = "; // Виводимо на консоль символи.
  cin >> R; // Користувач вводить число.
  cout << "Програма перевіряє, чи потрапляє точка A всередину (або на кордон) кола O.\n"; // Виводимо на консоль символи, нова строка.
  cout << "Введiть з клавіатури  координати (x, y) точки A на площині.\n"; // Виводимо на консоль символи, нова строка.
  cout << "X = "; // Виводимо на консоль символи.
  cin >> X; // Користувач вводить число.
  cout << "Y = "; // Виводимо на консоль символи.
  cin >> Y; // Користувач вводить число.
  if ((X-X0)*(X-X0)+(Y-Y0)*(Y-Y0)<=R*R) // Якщо значення точка А (х, у) є у цьому колі.
  { // Фігурні дужки перед початком виконання даної умови "Якщо значення точка А (х, у) є у цьому колі".
  cout << "Точка А ( " << X << ", " << Y << " ) знаходиться в окрузі O з центром в точці (" << X0 << ", " << Y0 << ") і радіусом " << R << "."; // Виводимо на консоль символи.
  } // Фігурні дужки після кінця виконання даної умови "Якщо значення точка А (х, у) є у цьому колі".
  else // Інакше.
  { // Фігурні дужки перед виконанням дій - інакше, якщо умова, яка задана раніше не виконується "Інакше".
  cout << "Точка А ( " << X << ", " << Y << " ) не знаходиться в окрузі O з центром в точці (" << X0 << ", " << Y0 << ") і радіусом " << R << "."; // Виводимо на консоль символи.
  } // Фігурні дужки після виконанням дій - інакше, якщо умова, яка задана раніше не виконується "Інакше".
  return 0; // Без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).