#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен ми використовуємо.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
    int A, B; // Задаємо зміннi.
    cout << "Задайте значення А і В, а програма визначить, яке число більше.\n"; // Виводимо на консоль символи, нова строка.
    cout << "A = "; // Виводимо на консоль символи.
    cin >> A; // Користувач вводить число.
    cout << "B = "; // Виводимо на консоль символи.
    cin >> B; // Користувач вводить число.
    if (A>B) // Якщо значення А більше значення В.
    { // Фігурні дужки перед початком виконання даної умови "Якщо значення А більше значення В".
    cout << "Max А = " << A; // Виводимо на консоль символи, і те, що прописав користувач.
    } // Фігурні дужки після кінця виконання даної умови "Якщо значення А більше значення В".
    if (B>A) // Якщо значення В більше значення А.
    { // Фігурні дужки перед початком виконання даної умови "Якщо значення B більше значення A".
     cout << "Max B = " << B; // Виводимо на консоль символи, і те, що прописав користувач.
    } // Фігурні дужки після кінця виконання даної умови "Якщо значення B більше значення A".
    if (A==B) // Якщо значення А дорівнює значенню В.
    { // Фігурні дужки перед початком виконання даної умови "Якщо значення А дорівнює значенню В".
    cout << "Max А = max B = " << A; // Виводимо на консоль символи, і те, що прописав користувач.
    } // Фігурні дужки після кінця виконання даної умови "Якщо значення А дорівнює значенню В".
    return 0; // Без повторень.
} // Фігурні дужки в яких пишется основний код програми (кінець).