#include <iostream> // Підключаємо бібліотека для вводу й виводу тексту на консоль.
using namespace std; // Вказуємо, який простір імен ми використовуємо.
int main() // Програма на С++ починається із виконання функції main.
{ // Фігурні дужки в яких пишется основний код програми (початок).
   int X; // Задаємо змінну.
      cout << "\n\n\n\n\t\tПрацює інформаційна система факультету прикладної математики: \n"; // Нові строки, горизонтальна табуляція, виводимо на консоль символи, нова строка.
      cout << "1. Новини дня\n"; // Виводимо на консоль символи, нова строка.
      cout << "2. Анекдот тижня\n"; // Виводимо на консоль символи, нова строка.
      cout << "3. Автора !!!\n\n"; // Виводимо на консоль символи, нові строки.
      cout << "Введіть відповідний номер і натисніть ENTER.\n"; // Виводимо на консоль символи,  нова строка.
      cout << "Щоб завершити програму, натисність цифру 5 і ENTER.\n"; // Виводимо на консоль символи, нова строка.
      cout << "Якщо введеш якийсь інший символ - натисни ENTER і спобуй знову.\n"; // Виводимо на консоль символи, нова строка.
      for (;;) // Безкінечний цикл.
      { // Фігурні дужки перед початком виконання даної умови "Безкінечний цикл".
      cin >> X ; // Користувач вводить число.
      if (X==1) // Якщо Х=1.
      { // Фігурні дужки перед початком виконання даної умови "Якщо Х=1".
      system ("clear"); // Очистка екрану. 
      cout << "\n\n\n\n\t\t\t\t\t\tНовини дня\n\n"; // Нові строки, горизонтальна табуляція, виводимо на консоль символи, нові строки.
      cout << "Сьогодні третя лабораторна робота з програмування. Усі до неї підготувалия, тому отримали 5, але з малою різницею у відсотках.\n\n"; // Виводимо на консоль символи, нові строки.
      cout << "Натисність 4 і Enter, щоб повернутись на головну сторінку.\n"; // Виводимо на консоль символи, нова строка.
      cout << "Щоб завершити програму, натисність цифру 5 і ENTER.\n"; // Виводимо на консоль символи, нова строка.
      cout << "Якщо введеш якийсь інший символ - натисни ENTER і спобуй знову.\n"; // Виводимо на консоль символи, нова строка.
      } // Фігурні дужки після кінця виконання даної умови "Якщо Х=1".
      if (X==2) // Якщо Х=2.
      { // Фігурні дужки перед початком виконання даної умови "Якщо Х=2".
      system ("clear"); // Очистка екрану. 
      cout << "\n\n\n\n\t\t\t\t\t\tАнекдот тижня\n\n"; // Нові строки, горизонтальна табуляція, виводимо на консоль символи, нові строки.
      cout << "Грають Каспаров із Крамником у шахи. У Каспарова позиція вже зовсім погана, але здаватися не хочеться. Ось він дивиться у віконце і бачить там якогось собачку.\n\n"; // Виводимо на консоль символи, нові строки.
      cout << "Каспаров:\n"; // Виводимо на консоль символи, нова строка.
      cout << "— Чуєш, Володю, чия це собачка бігає?\n"; // Виводимо на консоль символи, нова строка.
      cout << "Крамник:\n"; // Виводимо на консоль символи, нова строка.
      cout << "- Нічия.\n"; // Виводимо на консоль символи, нова строка.
      cout << "Каспаров:\n"; // Виводимо на консоль символи, нова строка.
      cout << "- Згоден.\n\n"; // Виводимо на консоль символи, нові строки.
      cout << "Натисність 4 і Enter, щоб повернутись на головну сторінку.\n"; // Виводимо на консоль символи, нова строка.
      cout << "Щоб завершити програму, натисність цифру 5 і ENTER.\n"; // Виводимо на консоль символи, нова строка.
      cout << "Якщо введеш якийсь інший символ - натисни ENTER і спобуй знову.\n"; // Виводимо на консоль символи, нова строка.
      } // Фігурні дужки після кінця виконання даної умови "Якщо Х=2".
      if (X==3) // Якщо Х=3.
      { // Фігурні дужки перед початком виконання даної умови "Якщо Х=3".
      system ("clear"); // Очистка екрану. 
      cout << "\n\n\n\n\t\t\t\t\t\tАвтора !!!\n\n"; // Нові строки, горизонтальна табуляція, виводимо на консоль символи, нові строки.
      cout << "Овдієнко Андрій\n\n"; // Виводимо на консоль символи,нові строки.
      cout << "Натисність 4 і Enter, щоб повернутись на головну сторінку.\n"; // Виводимо на консоль символи, нова строка.
      cout << "Щоб завершити програму, натисність цифру 5 і ENTER.\n"; // Виводимо на консоль символи, нова строка.
      cout << "Якщо введеш якийсь інший символ - натисни ENTER і спобуй знову.\n"; // Виводимо на консоль символи, нова строка.
      } // Фігурні дужки після кінця виконання даної умови "Якщо Х=3".
      if (X==4) // Якщо Х=4.
      { // Фігурні дужки перед початком виконання даної умови "Якщо Х=4".
      system ("clear"); // Очистка екрану. 
       cout << "\n\n\n\n\t\tПрацює інформаційна система факультету прикладної математики: \n"; // Нові строки, горизонтальна табуляція, виводимо на консоль символи, нова строка.
      cout << "1. Новини дня\n"; // Виводимо на консоль символи, нова строка.
      cout << "2. Анекдот тижня\n"; // Виводимо на консоль символи, нова строка.
      cout << "3. Автора !!!\n\n"; // Виводимо на консоль символи, нові строки.
      cout << "Введіть відповідний номер і натисніть ENTER.\n"; // Виводимо на консоль символи,  нова строка.
      cout << "Щоб завершити програму, натисність цифру 5 і ENTER.\n"; // Виводимо на консоль символи, нова строка.
      cout << "Якщо введеш якийсь інший символ - натисни ENTER і спобуй знову.\n"; // Виводимо на консоль символи, нова строка.
      } // Фігурні дужки після кінця виконання даної умови "Якщо Х=4".
      if(X==5) // Якщо Х=5.
      { // Фігурні дужки перед початком виконання даної умови "Якщо Х=5".
      system ("clear"); // Очистка екрану. 
      cout << "\n\n\n\n\t\t\tНа все добре, хай щастить.\n\n\n\n"; // Нові строки, горизонтальна табуляція, виводимо на консоль символи, нові строки.
      return 0; // Без повторень.
      } // Фігурні дужки після кінця виконання даної умови "Якщо Х=5".
   } // Фігурні дужки після кінця виконання даної умови "Безкінечний цикл".
} // Фігурні дужки в яких пишется основний код програми (кінець).